app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
	def index
		@post = Post.all.order("created_at DESC")

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
		# @post = Post.new(post_params) # before devise
		@post = current_user.posts.build(post_params)

		if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First post!!!! YAY!!!??"], ["updated_at", "2015-11-14 05:56:16.802314"], ["id", 1]]
---
	def update
		if @post.update(post_params)